Repository: jtsato/fms-transaction-api-netcore
Catalog: src/main/EntryPoint.WebApi/Resources/Messages.*.resx
Languages: pt_br

# CommonUnexpectedException
source: An unexpected error has occurred, please try again later!
pt_br: Ocorreu um erro inesperado, por favor tente novamente mais tarde!

# CommonValidationAlert
source: Please correct the errors and send your information again!
pt_br: Favor corrigir os erros e enviar os dados novamente!

# CommonUnexpectedExceptionWithParams
source: An unexpected error has occurred, please try again later! Details: {0}.
pt_br: Ocorreu um erro inesperado, por favor tente novamente mais tarde! Detalhes: {0}.

# CommonInvalidRequest
source: The request received is invalid. Check the format and the parameters in the documentation, correct them and try again.
pt_br: A solicitação recebida é inválida. Verifique o formato e os parâmetros na documentação, corrija-os e tente novamente.

# CommonJsonPropertyMissing
source: The property '{0}' is required.
pt_br: A propriedade '{0}' é obrigatória.

# CommonJsonPropertyInvalid
source: The property '{0}' is invalid.
pt_br: A propriedade '{0}' é inválida.

# CommonJsonPropertyWrongType
source: The property '{0}' has a value not compatible with it's expected types.
pt_br: A propriedade '{0}' possui um valor incompatível com o seu tipo esperado.

# ValidationTransactionAmountIsNullOrEmpty
source: The transaction 'amount' field is required.
pt_br: O conteúdo do campo 'valor' da transação é obrigatório.

# ValidationTransactionAmountIsNotDecimal
source: The content of the 'amount' field in the transaction is invalid.
pt_br: O conteúdo do campo 'valor' da transação é inválido.

# ValidationTransactionDateIsInvalid
source: The transaction 'date' field is invalid.
pt_br: O conteúdo do campo 'data' da transação é inválido.

# ValidationTransactionDateIsNullOrEmpty
source: The transaction 'date' field is required.
pt_br: O conteúdo do campo 'data' da transação é obrigatório.

# ValidationTransactionDescriptionIsNullOrEmpty
source: The transaction 'description' field is required.
pt_br: O conteúdo do campo 'descrição' da transação é obrigatório.

# ValidationTransactionTypeIsInvalid
source: The transaction 'type' field is invalid.
pt_br: O conteúdo do campo 'tipo' da transação é inválido.

# ValidationTransactionTypeIsNullOrEmpty
source: The transaction 'type' field is required.
pt_br: O conteúdo do campo 'tipo' da transação é obrigatório.
